BFBR2/BFBR2AtomsNoBiomass_50g_v_dp_restart_new/CFD/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{

    //wall
	CAD_patch0
    {
        type            slip;
    }
	CAD_patch2
    {

        type            slip;
    }
	fbBioin
    {
        //type            fixedValue;
        //value           uniform (0 0 0);
        type            slip;
    }

    fbOut
    {

        type            zeroGradient;
    }
	
    fbGasin
    {
        type            fixedValue;      
	//value		  uniform (0 0 0.16536);  //Umf
        //value           uniform (0 0 0.49608); //3Umf
       // value           uniform (0 0 0.66144); //4Umf
        //value           uniform (0 0 0.8268); //5Umf
	// value           uniform (0 0 1.15752); //7Umf
       // value           uniform (0 0 1.6536); //10Umf
      //  value           uniform (0 0 2.067);  //12.5Umf
       // value           uniform (0 0 2.4804); //15Umf

	type            uniformFixedValue;        
	uniformValue     table
        (
            (0.000 (0 0 0.05))
            (2.000 (0 0 0.05))
            (2.100 (0 0 0.10))
            (4.100 (0 0 0.10))
	    (4.200 (0 0 0.15))
            (6.200 (0 0 0.15))
            (6.300 (0 0 0.20))
            (8.300 (0 0 0.20))
            (8.400 (0 0 0.25))
            (10.400 (0 0 0.25))
            (10.500 (0 0 0.30))
            (12.500 (0 0 0.30))
            (12.600 (0 0 0.35))
            (14.600 (0 0 0.35))
            (14.700 (0 0 0.40))
            (16.700 (0 0 0.40))
            (16.800 (0 0 0.45))
            (18.800 (0 0 0.45))
            (18.900 (0 0 0.50))
            (20.900 (0 0 0.50))
            (21.000 (0 0 0.55))
            (23.00 (0 0 0.55))
            (23.100 (0 0 0.60))
            (25.100 (0 0 0.60))
            (25.200 (0 0 0.65))
            (27.200 (0 0 0.65))
            (27.300 (0 0 0.70))
            (29.300 (0 0 0.70))
            (29.400 (0 0 0.75))
            (31.400 (0 0 0.75))
            (31.500 (0 0 0.8))
            (33.500 (0 0 0.8))
            (33.600 (0 0 0.85))
            (35.600 (0 0 0.85))
            (35.700 (0 0 0.90))
            (37.700 (0 0 0.90))
            (37.800 (0 0 0.95))
            (39.800 (0 0 0.95))
            (39.900 (0 0 1.00))
            (41.900 (0 0 1.00))
            (42.000 (0 0 1.05))
            (44.000 (0 0 1.05))
            (44.100 (0 0 1.10))
            (46.100 (0 0 1.10))
            (46.200 (0 0 1.15))
            (48.200 (0 0 1.15))
            (48.300 (0 0 1.20))
            (50.300 (0 0 1.20))
            (50.400 (0 0 1.25))
            (52.400 (0 0 1.25))
            (52.500 (0 0 1.30))
            (54.500 (0 0 1.30))
            (54.600 (0 0 1.35))
            (56.600 (0 0 1.35))
            (56.700 (0 0 1.40))
            (58.700 (0 0 1.40))
            (58.800 (0 0 1.45))
            (60.800 (0 0 1.45))
            (60.900 (0 0 1.50))
            (62.900 (0 0 1.50))
            (63.000 (0 0 1.55))
            (65.000 (0 0 1.55))
            (65.100 (0 0 1.60))
            (67.100 (0 0 1.60))
            (67.200 (0 0 1.65))
            (69.200 (0 0 1.65))
            (69.300 (0 0 1.70))
            (71.300 (0 0 1.70))
            (71.400 (0 0 1.75))
            (73.400 (0 0 1.75))
            (73.500 (0 0 1.80))
            (75.500 (0 0 1.80))
            (75.600 (0 0 1.85))
            (77.600 (0 0 1.85))
            (77.700 (0 0 1.90))
            (79.700 (0 0 1.90))
            (79.800 (0 0 1.95))
            (81.800 (0 0 1.95))
            (81.900 (0 0 2.00))
            (83.900 (0 0 2.00))
            (84.000 (0 0 2.05))
            (86.000 (0 0 2.05))
            (86.100 (0 0 2.1))
            (88.100 (0 0 2.1))
            (88.200 (0 0 2.15))
            (90.200 (0 0 2.15))
            (90.300 (0 0 2.2))
            (92.300 (0 0 2.2))
            (92.400 (0 0 2.25))
            (94.400 (0 0 2.25))
            (94.500 (0 0 2.3))
            (96.500 (0 0 2.3))
            (96.600 (0 0 2.35))
            (98.600 (0 0 2.35))
            (98.700 (0 0 2.4))
            (100.700 (0 0 2.4))
            (100.800 (0 0 2.45))
            (102.800 (0 0 2.45))
            (102.900 (0 0 2.5))
...
            (336.900 (0 0 8.00))

	);

        /*type            flowRateInletVelocity;
        flowRate        0.001;
        value           uniform (0 0 0);*/

/*        type            groovyBC;
        variables       "Uend=vector(0,0,0.02);tEnd=0.1;";
        valueExpression "((time() < tEnd) ? Uend/tEnd*time():Uend)";
        value           u0iform (0 0 0);*/

        // 2.0.x, 1.6,ext
        /*type            timeVaryingUniformFixedValue;
        fileName        "steps_0p1s";
        outOfBounds     clamp;
        value           uniform (0 0 0);*/

        // 2.1.x or higher
       // type            uniformFixedValue;
      //  uniformValue     table
      //  (
     //       (0.000 (0 0 0.002))
      //      (0.100 (0 0 0.020))
        //上述用于得到Umf的大小
		//然后可用这个速度模拟持续一段时间，用此命令
        //type            fixedValue;
        //value           uniform (0 0 Umf);
	//	);
    }


}

// ************************************************************************* //
